app/controllers/games_controller.rb

  def gameDetails
    game = Game.find(params[:id])
    chess_game = Chess::Game.load_fen(game.fen)

    @game_id = game.id
    @game_status = chess_game.status.to_s.tr('_', ' ')
    @white_player = Player.find(game.player_white_id)
    @black_player = Player.find(game.player_black_id)
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def makeMove
    game = Game.find(params[:game_id])
    chess_game = Chess::Game.load_fen(game.fen)
    begin
      chess_game.move(params[:movement])
      flash[:error] = nil
      game.fen = chess_game.current.to_fen
      if chess_game.over?
        game.end_date = Date.today.strftime("%e %b %Y")
      end
      game.save
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "games" SET "fen" = ?, "end_date" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["fen", "1Q6/p1p2p1r/1k1p3p/N3p3/2B1P1p1/1N1P1PB1/PPP3PP/R3K2R b KQ - 2 23"], ["end_date", "2023-05-20"], ["updated_at", "2023-05-20 15:52:59.357343"], ["id", 3]]

  def addGame
    opponent_id = params[:player_field]
    chess_game = Chess::Game.new
    game = Game.new
    game.fen = chess_game.current.to_fen
    game.start_date = Date.today.strftime("%e %b %Y")
    game.status = chess_game.status.to_s.tr('_', ' ')
    game.who_moves = 'white'
    if params[:player_color] == "White"
      game.player_white_id = current_player.id
      game.player_black_id = opponent_id
    else
      game.player_white_id = opponent_id
      game.player_black_id = current_player.id
    end

    game.save
---
INSERT INTO "games" ("start_date", "fen", "end_date", "created_at", "updated_at", "player_white_id", "player_black_id", "who_moves", "status") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def analyze
      game = Game.find(params[:game_id])
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @game = Game.new(game_params)

    respond_to do |format|
      if @game.save
---
INSERT INTO "games" ("game_id", "status", "start_date", "who_moves", "fen", "end_date", "created_at", "updated_at", "player_white_id", "player_black_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @game.update(game_params)
---
UPDATE "games" SET "status" = ?, "who_moves" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["status", "Zakonczona"], ["who_moves", "Czarne"], ["updated_at", "2023-05-16 20:29:29.379522"], ["id", 1]]

  def playerGames
    @id = params[:id]
    @games = Game.where(:player_white_id == @id).or(Game.where(:player_black_id == @id))
---
SELECT * FROM "games" WHERE (player_white_id = 'id' or player_black_id = 9)

    def set_game
      @game = Game.find(params[:id])
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]