app/controllers/games_controller.rb

INSERT INTO "games" ("game_id", "status", "start_date", "who_moves", "fen", "end_date", "created_at", "updated_at", "player_white_id", "player_black_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @game = Game.new(game_params)

    respond_to do |format|
      if @game.save

UPDATE "games" SET "status" = ?, "who_moves" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["status", "Zakonczona"], ["who_moves", "Czarne"], ["updated_at", "2023-05-16 20:29:29.379522"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @game.update(game_params)