app/controllers/players_controller.rb

  def update
    respond_to do |format|
      if @player.update(player_params)
---
UPDATE "players" SET "player_id" = ?, "username" = ?, "updated_at" = ?, "encrypted_password" = ? WHERE "players"."id" = ?  [["player_id", ""], ["username", "magnusCarlsen"], ["updated_at", "2023-05-14 11:10:06.344255"], ["encrypted_password", "[FILTERED]"], ["id", 1]]

  def destroy
    @player.destroy
---
DELETE FROM "players" WHERE "players"."id" = ?  [["id", 4]]

    def set_player
      @player = Player.find(params[:id])
---
SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]